; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph2 - mode
	infrared1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(have_image Phenomenon8 spectrograph2)
	(have_image Phenomenon9 image0)
	(have_image Planet10 spectrograph2)
	(have_image Star11 spectrograph2)
	(have_image Star12 image0)
	(have_image Phenomenon13 spectrograph2)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 infrared1)
	(have_image Star16 image0)
))

)

; plan
1. (turn_to satellite2 groundstation2 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite2 phenomenon15 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon15)
   goals met: 0 of 9
5. (take_image satellite2 phenomenon15 instrument3 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation5 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 9
8. (take_image satellite2 phenomenon13 instrument3 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 2 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
10. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 2 of 9
11. (turn_to satellite0 phenomenon9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 9
12. (take_image satellite0 phenomenon9 instrument0 image0)
   added: (have_image phenomenon9 image0)
   goals met: 3 of 9
13. (turn_to satellite0 star12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star12)
   goals met: 3 of 9
14. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 4 of 9
15. (turn_to satellite0 star16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star16)
   goals met: 4 of 9
16. (take_image satellite0 star16 instrument0 image0)
   added: (have_image star16 image0)
   goals met: 5 of 9
17. (turn_to satellite2 phenomenon8 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon8)
   goals met: 5 of 9
18. (take_image satellite2 phenomenon8 instrument3 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 6 of 9
19. (turn_to satellite2 planet10 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet10)
   goals met: 6 of 9
20. (take_image satellite2 planet10 instrument3 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 7 of 9
21. (turn_to satellite2 planet14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet14)
   goals met: 7 of 9
22. (take_image satellite2 planet14 instrument3 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 8 of 9
23. (turn_to satellite2 star11 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star11)
   goals met: 8 of 9
24. (take_image satellite2 star11 instrument3 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 9 of 9
